
## Plan Result (ecs_practice/terraform)

[CI link](https://github.com/harayu-k/infra_sandbox/actions/runs/13029381688)


### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 6 to add, 1 to change, 3 to destroy.</code></pre>

* Create
  * aws_vpc_endpoint.interface[&#34;ecr_api&#34;]
  * aws_vpc_endpoint.interface[&#34;ecr_dkr&#34;]
  * aws_vpc_endpoint.interface_logs
  * aws_vpc_endpoint.s3_gateway
* Update
  * aws_iam_policy.backend_ecs_task_execution
* Delete
  * aws_ecr_repository.this[&#34;fluent-bit&#34;]
* Replace
  * aws_iam_policy.frontend_ecs_task_execution
  * aws_iam_policy_attachment.frontend_ecs_task_execution


<details><summary>Change Result (Click me)</summary>

```hcl

  # data.aws_iam_policy_document.backend_ecs_task_execution will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "backend_ecs_task_execution" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "ecr:GetAuthorizationToken",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "ecr:BatchCheckLayerAvailability",
              + "ecr:BatchGetImage",
              + "ecr:GetDownloadUrlForLayer",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:ecr:ap-northeast-1:992382441056:repository/backend",
            ]
        }
      + statement {
          + actions   = [
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:logs:ap-northeast-1:992382441056:log-group:/ecs/backend:*",
            ]
        }
    }

  # data.aws_iam_policy_document.frontend_ecs_task_execution will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "frontend_ecs_task_execution" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "ecr:GetAuthorizationToken",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "ecr:BatchCheckLayerAvailability",
              + "ecr:BatchGetImage",
              + "ecr:GetDownloadUrlForLayer",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:ecr:ap-northeast-1:992382441056:repository/frontend",
            ]
        }
      + statement {
          + actions   = [
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:logs:ap-northeast-1:992382441056:log-group:/ecs/frontend:*",
            ]
        }
    }

  # aws_ecr_repository.this["fluent-bit"] will be destroyed
  # (because key ["fluent-bit"] is not in for_each map)
  - resource "aws_ecr_repository" "this" {
      - arn                  = "arn:aws:ecr:ap-northeast-1:992382441056:repository/fluent-bit" -> null
      - force_delete         = true -> null
      - id                   = "fluent-bit" -> null
      - image_tag_mutability = "IMMUTABLE" -> null
      - name                 = "fluent-bit" -> null
      - registry_id          = "992382441056" -> null
      - repository_url       = "992382441056.dkr.ecr.ap-northeast-1.amazonaws.com/fluent-bit" -> null
      - tags                 = {} -> null
      - tags_all             = {
          - "Managed" = "Terraform"
        } -> null

      - encryption_configuration {
          - encryption_type = "AES256" -> null
            # (1 unchanged attribute hidden)
        }

      - image_scanning_configuration {
          - scan_on_push = false -> null
        }
    }

  # aws_iam_policy.backend_ecs_task_execution will be updated in-place
  ~ resource "aws_iam_policy" "backend_ecs_task_execution" {
        id               = "arn:aws:iam::992382441056:policy/backend-AWSECSTaskExeccutionRole"
        name             = "backend-AWSECSTaskExeccutionRole"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "ecr:GetAuthorizationToken"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = [
                          - "ecr:GetDownloadUrlForLayer",
                          - "ecr:BatchGetImage",
                          - "ecr:BatchCheckLayerAvailability",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ecr:ap-northeast-1:992382441056:repository/backend"
                    },
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:ap-northeast-1:992382441056:log-group:/ecs/backend:*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {}
        # (7 unchanged attributes hidden)
    }

  # aws_iam_policy.frontend_ecs_task_execution must be replaced
-/+ resource "aws_iam_policy" "frontend_ecs_task_execution" {
      ~ arn              = "arn:aws:iam::992382441056:policy/frontend-AWSECSTaskExeccutionRole" -> (known after apply)
      ~ attachment_count = 1 -> (known after apply)
      ~ id               = "arn:aws:iam::992382441056:policy/frontend-AWSECSTaskExeccutionRole" -> (known after apply)
      ~ name             = "frontend-AWSECSTaskExeccutionRole" -> "frontend-AWSECSTaskExeccutionRoletest" # forces replacement
      + name_prefix      = (known after apply)
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "ecr:GetAuthorizationToken"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = [
                          - "ecr:GetDownloadUrlForLayer",
                          - "ecr:BatchGetImage",
                          - "ecr:BatchCheckLayerAvailability",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ecr:ap-northeast-1:992382441056:repository/frontend"
                    },
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:ap-northeast-1:992382441056:log-group:/ecs/frontend:*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      ~ policy_id        = "ANPA6ODU2KZQMYXEPLUHJ" -> (known after apply)
      - tags             = {} -> null
        # (3 unchanged attributes hidden)
    }

  # aws_iam_policy_attachment.frontend_ecs_task_execution must be replaced
-/+ resource "aws_iam_policy_attachment" "frontend_ecs_task_execution" {
      - groups     = [] -> null
      ~ id         = "frontend-ECSTaskExecution" -> (known after apply)
        name       = "frontend-ECSTaskExecution"
      ~ policy_arn = "arn:aws:iam::992382441056:policy/frontend-AWSECSTaskExeccutionRole" -> (known after apply) # forces replacement
      - users      = [] -> null
        # (1 unchanged attribute hidden)
    }

  # aws_vpc_endpoint.interface["ecr_api"] will be created
  + resource "aws_vpc_endpoint" "interface" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = [
          + "sg-0b73364c50284a880",
        ]
      + service_name          = "com.amazonaws.ap-northeast-1.ecr.api"
      + state                 = (known after apply)
      + subnet_ids            = [
          + "subnet-05c836901eb4bd41b",
          + "subnet-0b7bb2ff6472f2b69",
        ]
      + tags                  = {
          + "Name" = "ecr_api"
        }
      + tags_all              = {
          + "Managed" = "Terraform"
          + "Name"    = "ecr_api"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = "vpc-04a61e17cecb81c94"

      + dns_options (known after apply)

      + subnet_configuration (known after apply)
    }

  # aws_vpc_endpoint.interface["ecr_dkr"] will be created
  + resource "aws_vpc_endpoint" "interface" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = [
          + "sg-0b73364c50284a880",
        ]
      + service_name          = "com.amazonaws.ap-northeast-1.ecr.dkr"
      + state                 = (known after apply)
      + subnet_ids            = [
          + "subnet-05c836901eb4bd41b",
          + "subnet-0b7bb2ff6472f2b69",
        ]
      + tags                  = {
          + "Name" = "ecr_dkr"
        }
      + tags_all              = {
          + "Managed" = "Terraform"
          + "Name"    = "ecr_dkr"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = "vpc-04a61e17cecb81c94"

      + dns_options (known after apply)

      + subnet_configuration (known after apply)
    }

  # aws_vpc_endpoint.interface_logs will be created
  + resource "aws_vpc_endpoint" "interface_logs" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = [
          + "sg-0b73364c50284a880",
        ]
      + service_name          = "com.amazonaws.ap-northeast-1.logs"
      + state                 = (known after apply)
      + subnet_ids            = [
          + "subnet-05c836901eb4bd41b",
          + "subnet-0b7bb2ff6472f2b69",
        ]
      + tags                  = {
          + "Name" = "cw-logs"
        }
      + tags_all              = {
          + "Managed" = "Terraform"
          + "Name"    = "cw-logs"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = "vpc-04a61e17cecb81c94"

      + dns_options (known after apply)

      + subnet_configuration (known after apply)
    }

  # aws_vpc_endpoint.s3_gateway will be created
  + resource "aws_vpc_endpoint" "s3_gateway" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = (known after apply)
      + requester_managed     = (known after apply)
      + route_table_ids       = [
          + "rtb-00bfb2a9a2de18751",
        ]
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.ap-northeast-1.s3"
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags                  = {
          + "Name" = "s3_gateway"
        }
      + tags_all              = {
          + "Managed" = "Terraform"
          + "Name"    = "s3_gateway"
        }
      + vpc_endpoint_type     = "Gateway"
      + vpc_id                = "vpc-04a61e17cecb81c94"

      + dns_options (known after apply)

      + subnet_configuration (known after apply)
    }

Plan: 6 to add, 1 to change, 3 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":45,"Program":"tfcmt","SHA1":"f95df4e8316775fb7109d76274fc11b505a8d559","Target":"ecs_practice/terraform","Vars":{},"WorkflowName":"terraform-plan"} -->